---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Structure.IRebarUpdateServer
source: html/f954b20f-a21b-35d3-fab1-d2bfdb616f39.htm
---
# IRebarUpdateServer Members

This function is supposed to calculate the bars in set based on data received in curvesData parameter.